#  .................................Задача 1..............................
# my_str = 'Дана ст(рока символов, среди которых есть одна открыв)ающаяся строка символов'
# new_str = my_str[my_str.find('(') + 1:my_str.find(')')]
#
# print(my_str)
# print()
# print(new_str)

#  .................................Задача 2..............................
#                               Вариант 1

# str1 = input("Введите несколько значений ")
# print("Строка:", str1)
# create_str = input("Ее заменяемая подстрока: ")
# new_str = input("Новая подстрока:")
# print(str1.replace(create_str, new_str))

#                               Вариант 2

# str1 = input("Введите несколько значений ")
# print("Строка: ", str1)
# create_str = input("Ее заменяемая подстрока: ")
# new_str = input("Новая подстрока:")
# str1 = str1.split(create_str)
# str1 = new_str.join(str1)
# print(str1)

#  .................................Задача 3..............................

# str1 = 'Ежевику для ежат\n' \
#        'Принесли два ежа.\n' \
#        'Ежевику еле-еле\n' \
#        'Ежата возле ели съели.'
# print(str1)
# print()
# print("Количество слов:", str1.count('Е') + str1.count(' е'))
