#   ......................Задача 1......................

# sl = {i: i ** 3 for i in range(1, 11)}
# print(sl)

#   ......................Задача 2......................

# st1 = set(input("Введите первую строчку"))
# st2 = set(input("Введите вторую строчку"))
#
# st = st1 - st2
# print(st)


#   ......................Задача 3......................

# st1 = set(input("Введите первую строчку: "))
# st2 = set(input("Введите вторую строчку: "))
#
# st = st1 | st2
# print(st)


#   ......................Задача 4......................

# st1 = set(input("Введите первую строчку: "))
# st2 = set(input("Введите вторую строчку: "))
#
# st = st1 ^ st2
# print(st)
